{
  "id": "PIA19808",
  "title": "Looking Up at Mars Rover Curiosity in Buckskin Selfie",
  "author": "NASA/JPL-Caltech/MSSS",
  "description": "This low-angle self-portrait of NASA's Curiosity Mars rover shows the vehicle at the site from which it reached down to drill into a rock target called \"Buckskin\" on lower Mount Sharp.  The selfie combines several component images taken by Curiosity's Mars Hand Lens Imager (MAHLI) on Aug. 5, 2015, during the 1,065th Martian day, or sol, of the rover's work on Mars. For scale, the rover's wheels are 20 inches (50 centimeters) in diameter and about 16 inches (40 centimeters) wide. This view is a portion of a larger panorama available at PIA19807.  A close look reveals a small rock stuck onto Curiosity's left middle wheel (on the right in this head-on view). The rock had been seen previously during periodic monitoring of wheel condition about three weeks earlier, in the MAHLI raw image at http://mars.nasa.gov/msl/multimedia/raw/?rawid=1046MH0002640000400290E01_DXXX&s=1046.  MAHLI is mounted at the end of the rover's robotic arm. For this self-portrait, the rover team positioned the camera lower in relation to the rover body than for any previous full self-portrait of Curiosity. This yielded a view that includes the rover's \"belly,\" as in a partial self-portrait (/catalog/PIA16137) taken about five weeks after Curiosity's August 2012 landing inside Mars' Gale Crater.  The selfie at Buckskin does not include the rover's robotic arm beyond a portion of the upper arm held nearly vertical from the shoulder joint. With the wrist motions and turret rotations used in pointing the camera for the component images, the arm was positioned out of the shot in the frames or portions of frames used in this mosaic. This process was used previously in acquiring and assembling Curiosity self-portraits taken at sample-collection sites \"Rocknest\" (PIA16468), \"John Klein\" (PIA16937), \"Windjana\" (PIA18390) and \"Mojave\" (PIA19142).  MAHLI was built by Malin Space Science Systems, San Diego. NASA's Jet Propulsion Laboratory, a division of the California Institute of Technology in Pasadena, manages the Mars Science Laboratory Project for the NASA Science Mission Directorate, Washington. JPL designed and built the project's Curiosity rover.  MAHLI was built by Malin Space Science Systems, San Diego. NASA's Jet Propulsion Laboratory, a division of the California Institute of Technology in Pasadena, manages the Mars Science Laboratory Project for the NASA Science Mission Directorate, Washington. JPL designed and built the project's Curiosity rover.  http://photojournal.jpl.nasa.gov/catalog/PIA19808",
  "year": "2015",
  "originalImageUrl": "http://images-assets.nasa.gov/image/PIA19808/PIA19808~orig.jpg",
  "sourcePage": "https://images.nasa.gov/details-PIA19808",
  "license": "Public Domain (NASA)",
  "fetchedFrom": "NASA Image and Video Library",
  "sourceCategory": "nasa-featured-collection",
  "categoryLabel": "Featured Collection",
  "fetchedAt": "2025-10-08T10:01:05.395Z"
}